In [1]:
import os
import sys
os.environ["SPARK_HOME"] = "/usr/hdp/current/spark2-client"
os.environ["PYLIB"] = os.environ["SPARK_HOME"] + "/python/lib"
sys.path.insert(0, os.environ["PYLIB"] + "/py4j-0.10.4-src.zip")
sys.path.insert(0, os.environ["PYLIB"] + "/pyspark.zip")

In [2]:
## Create SparkContext, SparkSession
from os.path import expanduser, join, abspath

from pyspark.sql import SparkSession
from pyspark.sql import Row

# warehouse_location points to the default location for managed databases and tables
warehouse_location = 'hdfs:///apps/hive/warehouse/'

spark = SparkSession \
    .builder \
    .appName("Python Spark SQL Hive integration example") \
    .config("spark.sql.warehouse.dir", warehouse_location) \
    .enableHiveSupport() \
    .getOrCreate()

In [3]:
##Use hive database which you have created
spark.sql("use insofe_b43_g6")

DataFrame[]

In [4]:
spark.sql("show tables").show()

+-------------+------------+-----------+
|     database|   tableName|isTemporary|
+-------------+------------+-----------+
|insofe_b43_g6| departments|      false|
|insofe_b43_g6|    dept_emp|      false|
|insofe_b43_g6|dept_manager|      false|
|insofe_b43_g6|   employees|      false|
|insofe_b43_g6|    salaries|      false|
|insofe_b43_g6|      titles|      false|
+-------------+------------+-----------+

In [5]:
deptDF = spark.sql("SELECT * FROM departments")

In [6]:
deptDF.show()

+-------+------------------+-------------------+
|dept_no|         dept_name|      last_modified|
+-------+------------------+-------------------+
|   d001|         Marketing|2013-01-28 23:59:59|
|   d002|           Finance|2013-01-28 23:59:59|
|   d003|   Human Resources|2013-01-28 23:59:59|
|   d004|        Production|2013-01-28 23:59:59|
|   d005|       Development|2013-01-28 23:59:59|
|   d006|Quality Management|2013-01-28 23:59:59|
|   d007|             Sales|2013-01-28 23:59:59|
|   d008|          Research|2013-01-28 23:59:59|
|   d009|  Customer Service|2013-01-28 23:59:59|
|   d010|         Analytics|2018-08-18 12:38:38|
+-------+------------------+-------------------+

In [21]:
dept_empDF = spark.sql("SELECT * FROM dept_emp")
dept_empDF.show(2)

+------+------+-------+----------+----------+-------------------+
|seq_no|emp_no|dept_no| from_date|   to_date|      last_modified|
+------+------+-------+----------+----------+-------------------+
|     1|     1|   d001|1986-01-01|9999-01-01|2013-01-28 23:59:59|
|    10|    10|   d002|1986-01-14|9999-01-01|2013-01-28 23:59:59|
+------+------+-------+----------+----------+-------------------+
only showing top 2 rows

In [11]:
dept_managerDF = spark.sql("SELECT * FROM dept_manager")
dept_managerDF.show(2)

+------+-------+------+----------+----------+-------------------+
|seq_no|dept_no|emp_no| from_date|   to_date|      last_modified|
+------+-------+------+----------+----------+-------------------+
|     1|   d001|     1|1986-01-01|1992-10-01|2013-01-28 23:59:59|
|    10|   d002|    10|1990-12-17|9999-01-01|2013-01-28 23:59:59|
+------+-------+------+----------+----------+-------------------+
only showing top 2 rows

In [13]:
employeesDF = spark.sql("SELECT * FROM employees")
employeesDF.show(2)

+------+----------+----------+----------+------+----------+-------------------+
|emp_no|birth_date|first_name| last_name|gender| hire_date|      last_modified|
+------+----------+----------+----------+------+----------+-------------------+
|     1|1958-09-12| Margareta|Markovitch|     M|1986-01-01|2013-01-28 23:59:59|
|     2|1961-10-28|      Ebru|     Alpin|     M|1986-01-01|2013-01-28 23:59:59|
+------+----------+----------+----------+------+----------+-------------------+
only showing top 2 rows

In [14]:
salariesDF = spark.sql("SELECT * FROM salaries")
salariesDF.show(2)

+------+------+------+----------+----------+-------------------+
|seq_no|emp_no|salary| from_date|   to_date|      last_modified|
+------+------+------+----------+----------+-------------------+
|     1|     1| 70166|1986-01-01|1987-01-01|2013-01-28 23:59:59|
|    10|     1| 91165|1994-12-30|1995-12-30|2013-01-28 23:59:59|
+------+------+------+----------+----------+-------------------+
only showing top 2 rows

In [15]:
titlesDF = spark.sql("SELECT * FROM titles")
titlesDF.show(2)

+------+------+----------------+----------+----------+-------------------+
|seq_no|emp_no|           title| from_date|   to_date|      last_modified|
+------+------+----------------+----------+----------+-------------------+
|     1|     1|         Manager|1986-01-01|1992-10-01|2013-01-28 23:59:59|
|    10|     5|Technique Leader|1993-04-25|9999-01-01|2013-01-28 23:59:59|
+------+------+----------------+----------+----------+-------------------+
only showing top 2 rows

In [54]:
DF = spark.sql("select e.emp_no,de.dept_no,e.birth_date,e.first_name,e.last_name,e.gender, \
               t.title,e.hire_date,s.salary,de.from_date,de.to_date,de.last_modified, \
               from  employees e inner join dept_emp de on e.emp_no=de.emp_no \
               inner join titles t on e.emp_no=t.emp_no \
               inner join salaries s on e.emp_no=s.emp_no \
               where de.to_date ='9999-01-01' and t.to_date='9999-01-01' and s.to_date='9999-01-01' ").show(1)

+------+-------+----------+----------+---------+------+---------------+----------+------+----------+----------+-------------------+
|emp_no|dept_no|birth_date|first_name|last_name|gender|          title| hire_date|salary| from_date|   to_date|      last_modified|
+------+-------+----------+----------+---------+------+---------------+----------+------+----------+----------+-------------------+
|   148|   d005|1960-03-11|    Feipei| Nollmann|     M|Senior Engineer|1986-02-03|121640|1986-02-03|9999-01-01|2013-01-28 23:59:59|
+------+-------+----------+----------+---------+------+---------------+----------+------+----------+----------+-------------------+
only showing top 1 row

In [55]:
DF1 = spark.sql("select count(*) \
               from  employees e inner join dept_emp de on e.emp_no=de.emp_no \+
               inner join titles t on e.emp_no=t.emp_no \
               inner join salaries s on e.emp_no=s.emp_no \
              where de.to_date ='9999-01-01' and t.to_date='9999-01-01' and s.to_date='9999-01-01' ").show()

+--------+
|count(1)|
+--------+
|  250124|
+--------+

In [50]:
ActiveEmp = spark.sql("select count(*) from  dept_emp e  where e.to_date ='9999-01-01' ").show()
ActiveTitles = spark.sql("select count(*) from  titles t  where t.to_date ='9999-01-01' ").show()
ActiveSal = spark.sql("select count(*) from  salaries s  where s.to_date ='9999-01-01' ").show()
#DFQ1 = spark.sql("select datediff(dw,birth_date,getdate),datediff(dw,hire_date,getdate) from ")

+--------+
|count(1)|
+--------+
|  250124|
+--------+

+--------+
|count(1)|
+--------+
|  250124|
+--------+

+--------+
|count(1)|
+--------+
|  250124|
+--------+

In [62]:
DF2 = spark.sql("select e.emp_no,de.dept_no,e.birth_date,e.first_name,e.last_name,e.gender, \
               t.title,e.hire_date,s.salary,de.from_date,de.to_date,de.last_modified,datediff(now(),birth_date)/365.25 as age, \
               datediff(now(),hire_date)/365.25 as tenure \
                from  employees e inner join dept_emp de on e.emp_no=de.emp_no \
               inner join titles t on e.emp_no=t.emp_no \
               inner join salaries s on e.emp_no=s.emp_no \
               where de.to_date ='9999-01-01' and t.to_date='9999-01-01' and s.to_date='9999-01-01' ").show(1)

+------+-------+----------+----------+---------+------+---------------+----------+------+----------+----------+-------------------+---------+---------+
|emp_no|dept_no|birth_date|first_name|last_name|gender|          title| hire_date|salary| from_date|   to_date|      last_modified|      age|   tenure|
+------+-------+----------+----------+---------+------+---------------+----------+------+----------+----------+-------------------+---------+---------+
|   148|   d005|1960-03-11|    Feipei| Nollmann|     M|Senior Engineer|1986-02-03|121640|1986-02-03|9999-01-01|2013-01-28 23:59:59|58.436687|32.536619|
+------+-------+----------+----------+---------+------+---------------+----------+------+----------+----------+-------------------+---------+---------+
only showing top 1 row